Switch to plantuml
